/* Sample content in English: 'Untitled 1'.  The first argument is a name, the second argument is replaced by a number. */
"%@ %@" = "%1$@ %2$@";

/* Message for when an exception is raised whe loading a color list */
"An error occurred while reading the color palette \\U2018%@\\U2019. Select a different palette." = "Väripalettia ”%@” luettaessa tapahtui virhe. Valitse toinen paletti.";

/* Message for a color panel save error */
"An error occurred while saving the color palette \\U2018%@\\U2019. Try saving again." = "Tallennettaessa väripalettia kohteeseen ”%@” tapahtui virhe. Tallenna uudelleen.";

/* Error to present to the user when there is a save failure. */
"An error occurred while trying to save the Custom Palette to \\U2018%@\\U2019. Try saving again." = "Tallennettaessa muokattua palettia kohteeseen ”%@” tapahtui virhe. Tallenna uudelleen.";

/* COMMENT */
"Are you sure you want to remove the entire \\U2018%@\\U2019 color palette?" = "Haluatko varmasti poistaa koko väripaletin ”%@”?";

/* Brightness slider text */
"Brightness" = "Kirkkaus";

/* COMMENT
   NEED COMMENT */
"Cancel" = "Kumoa";

/* Color space or profile model name; cyan-magenta-yellow-black */
"CMYK" = "CMYK";

/* Tooltip for the color lists palette button at the top of the color panel. */
"Color Palettes" = "Väripaletit";

/* Tooltip for the color sliders button in the top row of the color panel. */
"Color Sliders" = "Väriliukusäädin";

/* Tooltip for the color wheel button in the top row of the color panel. */
"Color Wheel" = "Väriympyrä";

/* Tooltip for the crayon picker button in the top row of the color panel. */
"Crayons" = "Kynävalitsin";

/* Name of the device-dependent CMYK (cyan-magenta-yellow-black) color space or profile in the color panel */
"Device CMYK" = "Laitteen CMYK";

/* Name of the device-dependent gray (monochrome)  color space or profile in the color panel */
"Device Gray" = "Laitteen harmaa";

/* Name of the device-dependent RGB (red-green-blue) color space or profile in the color panel. */
"Device RGB" = "Laitteen RGB";

/* Color space or profile model name */
"DeviceN" = "LaiteN";

/* NEED COMMENT */
"Error Renaming Palette" = "Virhe nimettäessä palettia uudelleen";

/* Name of the generic (or 'calibrated') CMYK (cyan-magenta-yellow-black) color space or color profile in the color panel. Note, here generic does not mean non-distinctive; it actually is the name of a particular color space or profile. */
"Generic CMYK" = "Yleinen CMYK";

/* Name of the generic (or 'calibrated') gray (monochrome) color space or profile in the color panel. Note, here generic does not mean non-distinctive; it actually is the name of a particular color space or profile. */
"Generic Gray" = "Yleinen harmaa";

/* Name of the generic (or 'calibrated') RGB (red-green-blue) color space or profile in the color panel. Note, here generic does not mean non-distinctive; it actually is the name of a particular color space or profile. */
"Generic RGB" = "Yleinen RGB";

/* Color space or profile model name; monochrome */
"Gray" = "Harmaa";

/* Title for menu item that, when clicked, will hide the color panel. */
"Hide Colors" = "Kätke värit";

/* Hue slider text */
"Hue" = "Sävy";

/* Tooltip for the image palettes button in the top row of the color panel. */
"Image Palettes" = "Kuvapaletit";

/* Color space or profile model name */
"Indexed" = "Indeksoitu";

/* NEED COMMENT */
"It\\U2019s unclear which item you want to rename. Make sure you have only selected one item." = "On epäselvää, minkä kohteen haluat nimetä uudelleen. Varmista, että olet valinnut vain yhden kohteen.";

/* Color space or profile model name */
"L*a*b*" = "L*a*b*";

/* Open palette panel title */
"New Color Palette" = "Uusi väripaletti";

/* COMMENT */
"New name for color palette:" = "Uusi nimi väripaletille:";

/* Open Color Pallete panel title */
"Open Color Palette" = "Avaa väripaletti";

/* Color space or profile model name */
"Pattern" = "Kuvio";

/* COMMENT
   NEED COMMENT */
"Remove" = "Poista";

/* COMMENT */
"Remove Color Palette" = "Poista väripaletti";

/* NEED COMMENT */
"Remove Palette" = "Poista paletti";

/* NEED COMMENT */
"Removing a Custom Palette is permanent. Are you sure you want to remove %@ from your custom palettes?" = "Muokatun paletin poisto on pysyvä. Haluatko varmasti poistaa paletin %@ muokatuista paleteista?";

/* Generic title for color renaming panels */
"Rename Color" = "Nimeä väri uudelleen";

/* Color space or profile model name; stands for red-green-blue */
"RGB" = "RGB";

/* Saturation slider text */
"Saturation" = "Kylläisyys";

/* Title for menu item that, when clicked, will show the color panel. */
"Show Colors" = "Näytä värit";

/* tool tip for list popup */
"The color palette \\U2018%@\\U2019 contains %ld colors." = "Väripaletissa ”%1$@” on %2$ld väriä.";

/* NEED COMMENT */
"The file \\U2018%@\\U2019 could not be removed." = "Tiedostoa ”%@” ei voitu poistaa.";

/* NEED COMMENT */
"The image \\U2018%@\\U2019 couldn\\U2019t be renamed to \\U2018%@\\U2019." = "Kuvaa ”%1$@” ei voitu nimetä uudelleen nimellä ”%2$@”.";

/* NEED COMMENT */
"The permission settings on file \\U2018%@\\U2019 don\\U2019t allow it to be modified." = "Tiedoston ”%@” oikeudet eivät salli sen muokkaamista.";

/* tool tip for list popup */
"The profile \\U2018%@\\U2019 contains %ld colors." = "Profiilissa ”%1$@” on %2$ld väriä.";

/* NEED COMMENT */
"There was a Color Panel error." = "Väripalettivirhe.";

/* Title for when a color panel has an exception raised when creating */
"There was an error opening a color palette." = "Avattaessa väripalettia tapahtui virhe.";

/* Error to present to the user when there is a save failure.
   Title for a color panel save error */
"There was an error saving a color palette." = "Tallennettaessa väripalettia tapahtui virhe.";

/* Message to show users that try to use the ColorSync button in the color panel for things like Pattern colors (which can't have profiles attached). */
"This color cannot use profiles." = "Tämä väri ei voi käyttää profiileja.";

/* Default new list name - Untitled
   Default new user palette name */
"Unnamed" = "Nimetön";

/* COMMENT */
"You already have a color named \\U2018%@\\U2019 in this list. Choose a different name." = "Väri nimeltä ”%@” on jo luettelossa. Valitse toinen nimi.";

/* NEED COMMENT */
"You already have a Custom Palette named \\U2018%@\\U2019. Choose a different name." = "Muokattu paletti nimeltä ”%@” on jo olemassa. Valitse toinen nimi.";

/* Message shown to user when they attempt to rename a color list to a name that is already in use. */
"You already have a palette named \\U2018%@\\U2019. Choose a different name." = "Paletti nimeltä ”%@” on jo olemassa. Valitse toinen nimi.";

/* NEED COMMENT */
"You can\\U2019t rename \\U2018%@\\U2019 to \\U2018%@\\U2019." = "Kohteelle ”‘%1$@” ei voida antaa nimeä ”%2$@”.";

